Kharn27/DoomRPG-RE/ESP32/src/esp32_sdl.cpp
#include <SDL.h>

#include <Arduino.h>
#include <TFT_eSPI.h>

#include <algorithm>

#include "esp32_sdl_platform.h"

struct SDL_Window {};
struct SDL_Renderer {};
struct SDL_GameController {};
struct SDL_Joystick {};
struct SDL_Haptic {};

struct SDL_Texture {
    int width;
    int height;
    int pitch;
    Uint16* pixels;
    Uint8 red;
    Uint8 green;
    Uint8 blue;
    bool hasColorKey;
    Uint16 colorKey;
};

struct SDL_RWops {
    enum Kind { MEMORY, FILE_STREAM } kind;
    Uint8* memory;
    size_t length;
    size_t position;
    FILE* file;
};

namespace {

const char* lastError = "";
constexpr int kLogicalWidth = 160;
constexpr int kLogicalHeight = 128;
constexpr int kPhysicalWidth = 320;
constexpr int kPhysicalHeight = 240;

TFT_eSPI* platformDisplay = nullptr;
Uint16* rendererPixels = nullptr;
Uint8 drawRed = 255;
Uint8 drawGreen = 255;
Uint8 drawBlue = 255;
Uint8 drawAlpha = 255;
int rendererBlendMode = SDL_BLENDMODE_NONE;
bool clipEnabled = false;
SDL_Rect rendererClip{0, 0, kLogicalWidth, kLogicalHeight};

void setError(const char* message) {
    lastError = message;
}

bool ensureRendererPixels() {
    if (rendererPixels != nullptr) return true;
    rendererPixels = static_cast<Uint16*>(
        calloc(kLogicalWidth * kLogicalHeight, sizeof(Uint16)));
    if (rendererPixels == nullptr) {
        setError("out of memory creating renderer framebuffer");
        Serial.println("[SDL] Unable to allocate 160x128 framebuffer");
        return false;
    }
    Serial.printf("[SDL] Renderer framebuffer allocated: %u bytes\n",
                  kLogicalWidth * kLogicalHeight * sizeof(Uint16));
    return true;
}

Uint16 rgb565(Uint8 r, Uint8 g, Uint8 b) {
    return static_cast<Uint16>(((r & 0xf8) << 8) |
                               ((g & 0xfc) << 3) | (b >> 3));
}

bool insideClip(int x, int y) {
    if (x < 0 || y < 0 || x >= kLogicalWidth || y >= kLogicalHeight) return false;
    if (!clipEnabled) return true;
    return x >= rendererClip.x && y >= rendererClip.y &&
           x < rendererClip.x + rendererClip.w &&
           y < rendererClip.y + rendererClip.h;
}

Uint16 blend565(Uint16 destination, Uint16 source, Uint8 alpha) {
    if (alpha == 255) return source;
    if (alpha == 0) return destination;
    const int inverse = 255 - alpha;
    const int sr = ((source >> 11) & 0x1f) * 255 / 31;
    const int sg = ((source >> 5) & 0x3f) * 255 / 63;
    const int sb = (source & 0x1f) * 255 / 31;
    const int dr = ((destination >> 11) & 0x1f) * 255 / 31;
    const int dg = ((destination >> 5) & 0x3f) * 255 / 63;
    const int db = (destination & 0x1f) * 255 / 31;
    return rgb565((sr * alpha + dr * inverse) / 255,
                  (sg * alpha + dg * inverse) / 255,
                  (sb * alpha + db * inverse) / 255);
}

void putPixel(int x, int y, Uint16 color) {
    if (!insideClip(x, y) || !ensureRendererPixels()) return;
    Uint16& destination = rendererPixels[y * kLogicalWidth + x];
    destination = rendererBlendMode == SDL_BLENDMODE_BLEND
                      ? blend565(destination, color, drawAlpha)
                      : color;
}

Uint16 modulate565(Uint16 color, const SDL_Texture* texture) {
    const int red = ((color >> 11) & 0x1f) * texture->red / 255;
    const int green = ((color >> 5) & 0x3f) * texture->green / 255;
    const int blue = (color & 0x1f) * texture->blue / 255;
    return static_cast<Uint16>((red << 11) | (green << 5) | blue);
}

bool rwSeek(SDL_RWops* source, size_t position) {
    if (source == nullptr) {
        return false;
    }
    if (source->kind == SDL_RWops::MEMORY) {
        if (position > source->length) {
            return false;
        }
        source->position = position;
        return true;
    }
    return fseek(source->file, static_cast<long>(position), SEEK_SET) == 0;
}

Uint16 readLe16(const Uint8* bytes) {
    return static_cast<Uint16>(bytes[0] | (bytes[1] << 8));
}

Uint32 readLe32(const Uint8* bytes) {
    return static_cast<Uint32>(bytes[0]) |
           (static_cast<Uint32>(bytes[1]) << 8) |
           (static_cast<Uint32>(bytes[2]) << 16) |
           (static_cast<Uint32>(bytes[3]) << 24);
}

void freeSurfaceParts(SDL_Surface* surface) {
    if (surface == nullptr) {
        return;
    }
    if (surface->format != nullptr) {
        if (surface->format->palette != nullptr) {
            free(surface->format->palette->colors);
            free(surface->format->palette);
        }
        free(surface->format);
    }
    free(surface->pixels);
}

}  // namespace

extern "C" {

Uint32 SDL_GetTicks(void) {
    return millis();
}

Uint16 SDL_SwapLE16(Uint16 value) {
    return value;
}

Uint32 SDL_SwapLE32(Uint32 value) {
    return value;
}

const char* SDL_GetError(void) {
    return lastError;
}

const char* SDL_GetScancodeName(int) {
    return "CYD input";
}

int SDL_SetMemoryFunctions(SDL_malloc_func, SDL_calloc_func,
                           SDL_realloc_func, SDL_free_func) {
    return 0;
}

void SDL_GetMemoryFunctions(SDL_malloc_func* mallocFn, SDL_calloc_func* callocFn,
                            SDL_realloc_func* reallocFn, SDL_free_func* freeFn) {
    if (mallocFn) *mallocFn = malloc;
    if (callocFn) *callocFn = calloc;
    if (reallocFn) *reallocFn = realloc;
    if (freeFn) *freeFn = free;
}

SDL_RWops* SDL_RWFromMem(void* memory, int size) {
    if (memory == nullptr || size < 0) {
        setError("invalid memory stream");
        return nullptr;
    }
    SDL_RWops* stream = static_cast<SDL_RWops*>(calloc(1, sizeof(SDL_RWops)));
    if (stream == nullptr) {
        setError("out of memory creating stream");
        return nullptr;
    }
    stream->kind = SDL_RWops::MEMORY;
    stream->memory = static_cast<Uint8*>(memory);
    stream->length = static_cast<size_t>(size);
    return stream;
}

SDL_RWops* SDL_RWFromFile(const char* path, const char* mode) {
    FILE* file = fopen(path, mode);
    if (file == nullptr) {
        setError("unable to open file");
        return nullptr;
    }
    SDL_RWops* stream = static_cast<SDL_RWops*>(calloc(1, sizeof(SDL_RWops)));
    if (stream == nullptr) {
        fclose(file);
        setError("out of memory creating file stream");
        return nullptr;
    }
    stream->kind = SDL_RWops::FILE_STREAM;
    stream->file = file;
    return stream;
}

