Kharn27/DoomRPG-RE/ESP32/src/esp32_sdl.cpp
Sint32 SDL_RWsize(SDL_RWops* context) {
    if (context == nullptr) {
        return -1;
    }
    if (context->kind == SDL_RWops::MEMORY) {
        return static_cast<Sint32>(context->length);
    }
    const long current = ftell(context->file);
    fseek(context->file, 0, SEEK_END);
    const long size = ftell(context->file);
    fseek(context->file, current, SEEK_SET);
    return static_cast<Sint32>(size);
}

Sint64 SDL_RWseek(SDL_RWops* context, Sint64 offset, int whence) {
    if (context == nullptr) return -1;
    if (context->kind == SDL_RWops::FILE_STREAM) {
        if (fseek(context->file, static_cast<long>(offset), whence) != 0) return -1;
        return static_cast<Sint64>(ftell(context->file));
    }

    Sint64 base = 0;
    if (whence == SEEK_CUR) base = static_cast<Sint64>(context->position);
    else if (whence == SEEK_END) base = static_cast<Sint64>(context->length);
    else if (whence != SEEK_SET) return -1;

    const Sint64 next = base + offset;
    if (next < 0 || static_cast<size_t>(next) > context->length) return -1;
    context->position = static_cast<size_t>(next);
    return next;
}

size_t SDL_RWread(SDL_RWops* context, void* ptr, size_t size, size_t count) {
    if (context == nullptr || ptr == nullptr || size == 0) {
        return 0;
    }
    if (context->kind == SDL_RWops::FILE_STREAM) {
        return fread(ptr, size, count, context->file);
    }
    const size_t requested = size * count;
    const size_t available = context->length - context->position;
    const size_t copied = std::min(requested, available);
    memcpy(ptr, context->memory + context->position, copied);
    context->position += copied;
    return copied / size;
}

size_t SDL_RWwrite(SDL_RWops* context, const void* ptr, size_t size, size_t count) {
    if (context == nullptr || ptr == nullptr || size == 0) {
        return 0;
    }
    if (context->kind == SDL_RWops::FILE_STREAM) {
        return fwrite(ptr, size, count, context->file);
    }
    const size_t requested = size * count;
    const size_t available = context->length - context->position;
    const size_t copied = std::min(requested, available);
    memcpy(context->memory + context->position, ptr, copied);
    context->position += copied;
    return copied / size;
}

int SDL_RWclose(SDL_RWops* context) {
    if (context == nullptr) {
        return 0;
    }
    int result = 0;
    if (context->kind == SDL_RWops::FILE_STREAM && context->file != nullptr) {
        result = fclose(context->file);
    }
    free(context);
    return result;
}

SDL_Surface* SDL_LoadBMP(const char* path) {
    SDL_RWops* stream = SDL_RWFromFile(path, "rb");
    return stream == nullptr ? nullptr : SDL_LoadBMP_RW(stream, SDL_TRUE);
}

SDL_Surface* SDL_LoadBMP_RW(SDL_RWops* source, int freeSource) {
    Uint8 header[54];
    if (source == nullptr || SDL_RWread(source, header, sizeof(header), 1) != 1 ||
        header[0] != 'B' || header[1] != 'M') {
        if (freeSource) SDL_RWclose(source);
        setError("unsupported BMP header");
        return nullptr;
    }

    const Uint32 pixelOffset = readLe32(header + 10);
    const Uint32 dibSize = readLe32(header + 14);
    const Sint32 width = static_cast<Sint32>(readLe32(header + 18));
    const Sint32 signedHeight = static_cast<Sint32>(readLe32(header + 22));
    const Uint16 bitsPerPixel = readLe16(header + 28);
    const Uint32 compression = readLe32(header + 30);
    Uint32 colorCount = readLe32(header + 46);

    if (dibSize < 40 || width <= 0 || signedHeight == 0 ||
        bitsPerPixel != 8 || compression != 0) {
        if (freeSource) SDL_RWclose(source);
        setError("only uncompressed 8-bit BMP is supported");
        return nullptr;
    }
    if (colorCount == 0) colorCount = 256;

    SDL_Surface* surface = static_cast<SDL_Surface*>(calloc(1, sizeof(SDL_Surface)));
    if (surface == nullptr) {
        if (freeSource) SDL_RWclose(source);
        setError("out of memory creating BMP surface");
        return nullptr;
    }
    surface->format = static_cast<SDL_PixelFormat*>(calloc(1, sizeof(SDL_PixelFormat)));
    surface->format->palette = static_cast<SDL_Palette*>(calloc(1, sizeof(SDL_Palette)));
    surface->format->palette->colors = static_cast<SDL_Color*>(calloc(colorCount, sizeof(SDL_Color)));
    surface->pixels = calloc(static_cast<size_t>(width), static_cast<size_t>(abs(signedHeight)));
    if (surface->format == nullptr || surface->format->palette == nullptr ||
        surface->format->palette->colors == nullptr || surface->pixels == nullptr) {
        freeSurfaceParts(surface);
        free(surface);
        if (freeSource) SDL_RWclose(source);
        setError("out of memory loading BMP");
        return nullptr;
    }

    surface->w = width;
    surface->h = abs(signedHeight);
    surface->pitch = width;
    surface->format->BitsPerPixel = 8;
    surface->format->BytesPerPixel = 1;
    surface->format->palette->ncolors = static_cast<int>(colorCount);

    if (!rwSeek(source, 14 + dibSize)) {
        SDL_FreeSurface(surface);
        if (freeSource) SDL_RWclose(source);
        setError("invalid BMP palette offset");
        return nullptr;
    }
    for (Uint32 index = 0; index < colorCount; ++index) {
        Uint8 bgra[4];
        if (SDL_RWread(source, bgra, sizeof(bgra), 1) != 1) {
            SDL_FreeSurface(surface);
            if (freeSource) SDL_RWclose(source);
            setError("truncated BMP palette");
            return nullptr;
        }
        SDL_Color& color = surface->format->palette->colors[index];
        color.r = bgra[2];
        color.g = bgra[1];
        color.b = bgra[0];
        color.a = 255;
    }

    const size_t filePitch = (static_cast<size_t>(width) + 3U) & ~3U;
    Uint8* row = static_cast<Uint8*>(malloc(filePitch));
    if (row == nullptr || !rwSeek(source, pixelOffset)) {
        free(row);
        SDL_FreeSurface(surface);
        if (freeSource) SDL_RWclose(source);
        setError("invalid BMP pixel data");
        return nullptr;
    }
    for (int fileY = 0; fileY < surface->h; ++fileY) {
        if (SDL_RWread(source, row, filePitch, 1) != 1) {
            free(row);
            SDL_FreeSurface(surface);
            if (freeSource) SDL_RWclose(source);
            setError("truncated BMP pixel data");
            return nullptr;
        }
        const int destinationY = signedHeight > 0 ? surface->h - 1 - fileY : fileY;
        memcpy(static_cast<Uint8*>(surface->pixels) + destinationY * surface->pitch,
               row, static_cast<size_t>(width));
    }
    free(row);
    if (freeSource) SDL_RWclose(source);
    return surface;
}

