Kharn27/DoomRPG-RE/ESP32/src/esp32_sdl.cpp
void SDL_FreeSurface(SDL_Surface* surface) {
    if (surface == nullptr) return;
    freeSurfaceParts(surface);
    free(surface);
}

Uint32 SDL_MapRGB(const SDL_PixelFormat*, Uint8 r, Uint8 g, Uint8 b) {
    return (static_cast<Uint32>(r) << 16) |
           (static_cast<Uint32>(g) << 8) | b;
}

int SDL_SetColorKey(SDL_Surface* surface, int flag, Uint32 key) {
    if (surface == nullptr) return -1;
    surface->hasColorKey = flag;
    surface->colorKey = key;
    return 0;
}

SDL_Texture* SDL_CreateTexture(SDL_Renderer*, Uint32 format, int, int width, int height) {
    if (format != SDL_PIXELFORMAT_RGB565 || width <= 0 || height <= 0) {
        setError("unsupported texture format");
        return nullptr;
    }
    SDL_Texture* texture = static_cast<SDL_Texture*>(calloc(1, sizeof(SDL_Texture)));
    if (texture == nullptr) return nullptr;
    texture->pixels = static_cast<Uint16*>(calloc(static_cast<size_t>(width) * height, sizeof(Uint16)));
    if (texture->pixels == nullptr) {
        free(texture);
        return nullptr;
    }
    texture->width = width;
    texture->height = height;
    texture->pitch = width * 2;
    texture->red = texture->green = texture->blue = 255;
    return texture;
}

SDL_Texture* SDL_CreateTextureFromSurface(SDL_Renderer* renderer, SDL_Surface* surface) {
    if (surface == nullptr || surface->format == nullptr || surface->format->palette == nullptr) {
        return nullptr;
    }
    SDL_Texture* texture = SDL_CreateTexture(renderer, SDL_PIXELFORMAT_RGB565,
                                             SDL_TEXTUREACCESS_STREAMING,
                                             surface->w, surface->h);
    if (texture == nullptr) return nullptr;
    texture->hasColorKey = surface->hasColorKey;
    const Uint8* source = static_cast<const Uint8*>(surface->pixels);
    for (int y = 0; y < surface->h; ++y) {
        for (int x = 0; x < surface->w; ++x) {
            const SDL_Color& color = surface->format->palette->colors[source[y * surface->pitch + x]];
            texture->pixels[y * surface->w + x] = rgb565(color.r, color.g, color.b);
        }
    }
    if (texture->hasColorKey) {
        texture->colorKey = rgb565((surface->colorKey >> 16) & 0xff,
                                   (surface->colorKey >> 8) & 0xff,
                                   surface->colorKey & 0xff);
    }
    return texture;
}

void SDL_DestroyTexture(SDL_Texture* texture) {
    if (texture == nullptr) return;
    free(texture->pixels);
    free(texture);
}

int SDL_UpdateTexture(SDL_Texture* texture, const SDL_Rect* rect,
                      const void* pixels, int pitch) {
    if (texture == nullptr || pixels == nullptr) return -1;
    SDL_Rect area = rect == nullptr ? SDL_Rect{0, 0, texture->width, texture->height} : *rect;
    for (int y = 0; y < area.h; ++y) {
        memcpy(texture->pixels + (area.y + y) * texture->width + area.x,
               static_cast<const Uint8*>(pixels) + y * pitch,
               static_cast<size_t>(area.w) * sizeof(Uint16));
    }
    return 0;
}

int SDL_SetTextureColorMod(SDL_Texture* texture, Uint8 r, Uint8 g, Uint8 b) {
    if (texture == nullptr) return -1;
    texture->red = r;
    texture->green = g;
    texture->blue = b;
    return 0;
}

int SDL_RenderCopy(SDL_Renderer*, SDL_Texture* texture, const SDL_Rect* source,
                   const SDL_Rect* destination) {
    if (texture == nullptr || !ensureRendererPixels()) return -1;
    const SDL_Rect src = source == nullptr
        ? SDL_Rect{0, 0, texture->width, texture->height} : *source;
    const SDL_Rect dst = destination == nullptr
        ? SDL_Rect{0, 0, src.w, src.h} : *destination;
    if (src.w <= 0 || src.h <= 0 || dst.w <= 0 || dst.h <= 0) return -1;

    const int startX = std::max(0, dst.x);
    const int startY = std::max(0, dst.y);
    const int endX = std::min(kLogicalWidth, dst.x + dst.w);
    const int endY = std::min(kLogicalHeight, dst.y + dst.h);
    for (int y = startY; y < endY; ++y) {
        if (clipEnabled && (y < rendererClip.y || y >= rendererClip.y + rendererClip.h)) continue;
        const int sourceY = src.y + ((y - dst.y) * src.h) / dst.h;
        if (sourceY < 0 || sourceY >= texture->height) continue;
        for (int x = startX; x < endX; ++x) {
            if (!insideClip(x, y)) continue;
            const int sourceX = src.x + ((x - dst.x) * src.w) / dst.w;
            if (sourceX < 0 || sourceX >= texture->width) continue;
            const Uint16 color = texture->pixels[sourceY * texture->width + sourceX];
            if (texture->hasColorKey && color == texture->colorKey) continue;
            rendererPixels[y * kLogicalWidth + x] = modulate565(color, texture);
        }
    }
    return 0;
}

int SDL_RenderSetClipRect(SDL_Renderer*, const SDL_Rect* rect) {
    clipEnabled = rect != nullptr;
    rendererClip = rect == nullptr ? SDL_Rect{0, 0, kLogicalWidth, kLogicalHeight} : *rect;
    return 0;
}

int SDL_SetRenderDrawColor(SDL_Renderer*, Uint8 r, Uint8 g, Uint8 b, Uint8 a) {
    drawRed = r;
    drawGreen = g;
    drawBlue = b;
    drawAlpha = a;
    return 0;
}

int SDL_SetRenderDrawBlendMode(SDL_Renderer*, int blendMode) {
    rendererBlendMode = blendMode;
    return 0;
}

int SDL_RenderClear(SDL_Renderer*) {
    if (!ensureRendererPixels()) return -1;
    std::fill(rendererPixels, rendererPixels + kLogicalWidth * kLogicalHeight,
              rgb565(drawRed, drawGreen, drawBlue));
    return 0;
}

void SDL_RenderPresent(SDL_Renderer*) {
    if (platformDisplay == nullptr || !ensureRendererPixels()) return;
    Uint16 outputRow[kPhysicalWidth];
    const uint32_t started = micros();
    platformDisplay->startWrite();
    platformDisplay->setAddrWindow(0, 0, kPhysicalWidth, kPhysicalHeight);
    for (int y = 0; y < kPhysicalHeight; ++y) {
        const int sourceY = y * kLogicalHeight / kPhysicalHeight;
        const Uint16* source = rendererPixels + sourceY * kLogicalWidth;
        for (int x = 0; x < kLogicalWidth; ++x) {
            outputRow[x * 2] = source[x];
            outputRow[x * 2 + 1] = source[x];
        }
        platformDisplay->pushPixels(outputRow, kPhysicalWidth);
    }
    platformDisplay->endWrite();
    Serial.printf("[SDL] Present 160x128 -> 320x240: %lu us\n", micros() - started);
}

int SDL_RenderDrawRect(SDL_Renderer* renderer, const SDL_Rect* rect) {
    if (rect == nullptr) return -1;
    SDL_RenderDrawLine(renderer, rect->x, rect->y, rect->x + rect->w - 1, rect->y);
    SDL_RenderDrawLine(renderer, rect->x, rect->y + rect->h - 1,
                       rect->x + rect->w - 1, rect->y + rect->h - 1);
    SDL_RenderDrawLine(renderer, rect->x, rect->y, rect->x, rect->y + rect->h - 1);
    SDL_RenderDrawLine(renderer, rect->x + rect->w - 1, rect->y,
                       rect->x + rect->w - 1, rect->y + rect->h - 1);
    return 0;
}

int SDL_RenderFillRect(SDL_Renderer*, const SDL_Rect* rect) {
    const SDL_Rect area = rect == nullptr
        ? SDL_Rect{0, 0, kLogicalWidth, kLogicalHeight} : *rect;
    const Uint16 color = rgb565(drawRed, drawGreen, drawBlue);
    for (int y = area.y; y < area.y + area.h; ++y) {
        for (int x = area.x; x < area.x + area.w; ++x) putPixel(x, y, color);
    }
    return 0;
}

